{"Island of the Old Man": {"text": "You land on a small island, which from your boat, you can see two small caves, and an old man.  At closer inspection, you can see that the man is not in fact clothed in traditional garments, but is clothed instead with only his own body hair.  He calls out to you 'Be you Christian men? If so, please do not hesitate to join me for a brief time'. ", "branches": {"Cave of Drink": "You enter the Cave of Drink.  Inside, there is a small pool of crystal clear water against the back wall of the cave that appears to fill from nowhere.  When you ask the man about it, he only replies 'Thanks be to God'.  ", "Cave of Food": "You enter the Cave of Food, and sit at an empty table.  You look around and see no food, but the old man promises you will be provided for.  You look away at your companions for a second, and the old man places down a piece of fish and a fresh vegtable at your plate.  You ask the man, but replies that 'Only by the grace of God am I and my guests so well provided for'.  You say a prayer of thanksgiving with him, eat your meal, and exit the cave.  "}}, "Pillars of Mist": {"text": "You boat approaches a choice: to the right, a narrow gap between two pillars of fire, and to the left, a swirling whirlpool.  ", "branches": {"Twin Columns of Fire": "You sail through the two columns of fire, perfectly through the middle.  Had you been any closer to either side, your ship surely would have caught fire.  As you ride through the fire you see an island in the distance that looks more like a bonfire than any land mass you have ever seen.  It appears as though the whole land is in flames.  As you ride closer, you see not only that it is indeed covered in flames, but also that flying through them are humanoid creatures, with wings and charred, droopy skin hanging off of their bodies as they fly sickly around the island.  You wisely decide to turn your boat around and head back out where you came from.  ", "Swirling Whirlpool": "You sail, perhaps unwisely, towards the swirling whirlpool.  Caught in its pull, you feel your boat being pulled by the strength of the whirlpool.  Yelling at the top of your lungs, you urge your crew to row as hard as they can to try and escape.  Your boat swirls around and around, doom appearing to be evident.  However, your men give one last push, and using the circular momentum you have from the swirling water, the boat slings free from the pull of the deadly waters.  Unfortunaley (or fortunatley, depending on your opinion), you managed to escape the whirlpool exactly into the spot you started at.  "}}, "Woodland": {"text": "You disembark on an island which, apart from small sandy beach you landed at, contains nothing except an enormous forest with two paths, both dark, but one slightly more welcoming looking.  ", "branches": {"Dark Forest Path": "You enter the dark forest path, which you can barely make out in the low light.  You walk for miles and miles, but the path seems neither to turn nor be nearing an end.  You turn around to walk back, and within minutes, find yourself back at your ship.  ", "Pitch Black Forest Path": "You enter the Pitch Black Forest path.  Within minutes, you find yourself completley unable to see even your own hands.  The darkness begins to feel like a physical weight, pressing down on you until you can hardly breathe.  You slowly find your conciousness fading, until you collapse, unconcious.  You and your crew awake back on your ship, all seemingly unharmed with the exception of two small marks at the base of each man's neck.  "}}, "Fisherman's Paradise": {"text": "You find an island with very little land, but that is surronded with an enourmous wooden boardwalk and many wooden huts.  Nearly everyone you see has a fishing pole either in hand or nearby.  You see a large wooden inn on one side of the boardwalk, and on the other, an old run down shell of a shack.  ", "branches": {"Dilapidated Shack": "You enter a run down shack.  It appears mostly empty save a bedroll that looks much more recently used than the rest of the shack's contents.  Very curious.  ", "Salmon's Head Inn": "You enter the Salmon's Head Inn, and the warmth of the hearth welcomes you.  The friendly inkeep approaches you and offers you the house ale as well as some of the land's fresh fish.  You eat and head up to your room, questioning why he never asked for any payment.  You fall asleep, and when you awake, one of your companions is gone.  You look around the small island but cannot find him..."}}, "Isle of Impossible Beasts": {"text": "On this Island, you see two pens.  One pen contains what looks like nearly one-hundred very small horses.  The other holds one duck that appears several times larger than one would expect.  ", "branches": {"Pen of Enormous Ducks": "You see in this pen an enormous duck - it is nearly the size of a horse! You approach it, but based on the sounds emitting from it that run a chill down your spine, you want nothing to do with this beast.  You quickly retreat.  ", "Pen of Miniature Horses": "You see here a pen of horses.  They look totally normal; however, they are all diminutive in size, approaching the average height of a duck.  You lean on the edge and reach your hand in to pet one; however you quickly withdraw it - they do not sound friendly.  "}}, "The Mountains of Wind and Rain": {"text": "You see on this rather large island, two towering mountains - on one, you can see a dark raincloud.  On the other, you see nothing unusual, but you can hear a fierce, roaring wind.  ", "branches": {"The Mountain of Rain": "You begin the long trek up the Mountain of Rain.  As the name suggests, it does not take long before your clothes are soaked, and you are shivering, chilled to the bone.  Your company enters a small cave and starts a fire, but it hardly even helps.  As you exit the cave and try to continue up the mountain path, you find the path so covered in mud and water that you cannot even continue.  Dejected, you and your companions carefully retread your footsteps back to the base of the mountains.  ", "The Mountain of Wind": "You being the long trek up the Mountain of Wind.  You are constantly buffeted all the way up the mountain.  About halfway up, you approach a small plateau, for which you are incredibly greatful - you could hardly move up the wind was so harsh, and it seemed as if you could be blown off at any minute.  One of your traveling companions approaches you that the company might have better luck if everyone were to stay low and use their daggers to dig into the flat ground in order to prevent yourselves from blowing away.  This approach works, and you reach the top of the island where you find a locked chest.  You kick it open, but find only the tattered remains of what looked to be once beautiful garments, and a small golden ring, which you pocket.  "}}, "Isle of the Gnomes": {"text": "You approach the island, which visible to you now is only a hill with a cave entrance at its base.  There is also only a few feet offshore a large stone statue of a what looks like a man with very squashed proportions.", "branches": {"Overlook": "You climb up onto a the top of a large hill overlooking the island.  It is covered with what appears to be holes in the ground and caves, which appear every few hundred paces.  This gives you a gut feeling of unease. ", "Gnome Cave": "You enter a cave that sprawls out beyond the edge of your vision.  You see nothing but the glint of thousands of tiny eyes, watching your every move.  This cave makes you feel uneasy, so you quickly exit before anything goes wrong.  "}}}