{"The Mountains of Wind and Rain": {"text": "You see on this rather large island, two towering mountains - on one, you can see a dark raincloud.  On the other, you see nothing unusual, but you can hear a fierce, roaring wind.  ", "branches": {"The Mountain of Rain": "You begin the long trek up the Mountain of Rain.  As the name suggests, it does not take long before your clothes are soaked, and you are shivering, chilled to the bone.  Your company enters a small cave and starts a fire, but it hardly even helps.  As you exit the cave and try to continue up the mountain path, you find the path so covered in mud and water that you cannot even continue.  Dejected, you and your companions carefully retread your footsteps back to the base of the mountains.  ", "The Mountain of Wind": "You being the long trek up the Mountain of Wind.  You are constantly buffeted all the way up the mountain.  About halfway up, you approach a small plateau, for which you are incredibly greatful - you could hardly move up the wind was so harsh, and it seemed as if you could be blown off at any minute.  One of your traveling companions approaches you that the company might have better luck if everyone were to stay low and use their daggers to dig into the flat ground in order to prevent yourselves from blowing away.  This approach works, and you reach the top of the island where you find a locked chest.  You kick it open, but find only the tattered remains of what looked to be once beautiful garments, and a small golden ring, which you pocket.  "}}, "The Land of the Giants": {"text": "You land on an island where you see a male and a female giant on opposite ends of a wide field.  They are both nearly twice the size of a house.  ", "branches": {"The Male": "You approach the male giant, but he is not interested in talking with you right now.  ", "The Female": "You approach the female giant.  She is confused, as she has never seen someone as small as you before.  She picks you up but you yell at her to set you down.  She drops you with a thud and backs away, startled.  "}}, "The Island of Women": {"text": "As you approach the next island, you see a crowd of women approaching the shore.  You disembark and begin to talk to their leader.  As you continue talking, time seems to just melt away.  These women clearly do not want you to leave.  ", "branches": {"Main Building": "As you enter the main building, you are surrounded by the female inhabitants.  They talk incessantly about how happy that they are with your presence and how much they enjoy your company.  They then bring you food and drink and promise to bring you back to their sleeping quarters later tonight.  ", "Sleeping Quarters": "As you enter their sleeping quarters, their leader takes your hand and pulls you with her.  You emerge several days later and slightly confused.  "}}, "Island of the Old Man": {"text": "You land on a small island, which from your boat, you can see two small caves, and an old man.  At closer inspection, you can see that the man is not in fact clothed in traditional garments, but is clothed instead with only his own body hair.  He calls out to you 'Be you Christian men? If so, please do not hesitate to join me for a brief time'. ", "branches": {"Cave of Drink": "You enter the Cave of Drink.  Inside, there is a small pool of crystal clear water against the back wall of the cave that appears to fill from nowhere.  When you ask the man about it, he only replies 'Thanks be to God'.  ", "Cave of Food": "You enter the Cave of Food, and sit at an empty table.  You look around and see no food, but the old man promises you will be provided for.  You look away at your companions for a second, and the old man places down a piece of fish and a fresh vegtable at your plate.  You ask the man, but replies that 'Only by the grace of God am I and my guests so well provided for'.  You say a prayer of thanksgiving with him, eat your meal, and exit the cave.  "}}, "Pillars of Mist": {"text": "You boat approaches a choice: to the right, a narrow gap between two pillars of fire, and to the left, a swirling whirlpool.  ", "branches": {"Twin Columns of Fire": "You sail through the two columns of fire, perfectly through the middle.  Had you been any closer to either side, your ship surely would have caught fire.  As you ride through the fire you see an island in the distance that looks more like a bonfire than any land mass you have ever seen.  It appears as though the whole land is in flames.  As you ride closer, you see not only that it is indeed covered in flames, but also that flying through them are humanoid creatures, with wings and charred, droopy skin hanging off of their bodies as they fly sickly around the island.  You wisely decide to turn your boat around and head back out where you came from.  ", "Swirling Whirlpool": "You sail, perhaps unwisely, towards the swirling whirlpool.  Caught in its pull, you feel your boat being pulled by the strength of the whirlpool.  Yelling at the top of your lungs, you urge your crew to row as hard as they can to try and escape.  Your boat swirls around and around, doom appearing to be evident.  However, your men give one last push, and using the circular momentum you have from the swirling water, the boat slings free from the pull of the deadly waters.  Unfortunaley (or fortunatley, depending on your opinion), you managed to escape the whirlpool exactly into the spot you started at.  "}}, "The Theatre": {"text": "You approach this desert island, which appears to contain nothing but an enourmous ampitheater, with no audience, but a full stage that seems to be putting on a large production.  ", "branches": {"Backstage": "You decide instead of watching the show, to try and see what is going on behind it.  You sneak around the enoumous ampitheater, and enter a room that leads underneath the stage.  What you see makes you happy that you did not stay for the duration of the play - beneath the stage are numerous sharp implements that look caked in relativley fresh looking blood... You hear the creak of a door, and a masked figure enters.  You thank the heavens that you bought your axe with you, as you smash his head with the flat side.  You may have only incapacitated him, so you run away as fast as you can to get back to your company.  ", "The Front Row": "You sit in the front row benches - your company makes up all of the audience, but the performes seem not to mind.  They continue on with their show, which seems to have no end in sight.  You and your men quickly lose interest - though they are clearly skilled performers, this is not your preferred venue of entertainment.  "}}, "Woodland": {"text": "You disembark on an island which, apart from small sandy beach you landed at, contains nothing except an enormous forest with two paths, both dark, but one slightly more welcoming looking.  ", "branches": {"Dark Forest Path": "You enter the dark forest path, which you can barely make out in the low light.  You walk for miles and miles, but the path seems neither to turn nor be nearing an end.  You turn around to walk back, and within minutes, find yourself back at your ship.  ", "Pitch Black Forest Path": "You enter the Pitch Black Forest path.  Within minutes, you find yourself completley unable to see even your own hands.  The darkness begins to feel like a physical weight, pressing down on you until you can hardly breathe.  You slowly find your conciousness fading, until you collapse, unconcious.  You and your crew awake back on your ship, all seemingly unharmed with the exception of two small marks at the base of each man's neck.  "}}, "Fisherman's Paradise": {"text": "You find an island with very little land, but that is surronded with an enourmous wooden boardwalk and many wooden huts.  Nearly everyone you see has a fishing pole either in hand or nearby.  You see a large wooden inn on one side of the boardwalk, and on the other, an old run down shell of a shack.  ", "branches": {"Dilapidated Shack": "You enter a run down shack.  It appears mostly empty save a bedroll that looks much more recently used than the rest of the shack's contents.  Very curious.  ", "Salmon's Head Inn": "You enter the Salmon's Head Inn, and the warmth of the hearth welcomes you.  The friendly inkeep approaches you and offers you the house ale as well as some of the land's fresh fish.  You eat and head up to your room, questioning why he never asked for any payment.  You fall asleep, and when you awake, one of your companions is gone.  You look around the small island but cannot find him..."}}, "Isle of Impossible Beasts": {"text": "On this Island, you see two pens.  One pen contains what looks like nearly one-hundred very small horses.  The other holds one duck that appears several times larger than one would expect.  ", "branches": {"Pen of Enormous Ducks": "You see in this pen an enormous duck - it is nearly the size of a horse! You approach it, but based on the sounds emitting from it that run a chill down your spine, you want nothing to do with this beast.  You quickly retreat.  ", "Pen of Miniature Horses": "You see here a pen of horses.  They look totally normal; however, they are all diminutive in size, approaching the average height of a duck.  You lean on the edge and reach your hand in to pet one; however you quickly withdraw it - they do not sound friendly.  "}}, "First Contact": {"text": "As you voyage through the ocean, you come across two other expeditions.  One appears to be onshore of a small island, while the other is another boat passing by in the other direction.  ", "branches": {"A Familliar Face": "Your ship passes next to a traditional Irish coracle, holding a group of men who appear to be monks.  You wonder who this may be, but they are clearly intent onpraying, as it is currently time for Vespers.  ", "Too soon?": "You see a small island with a group of four people that appear to be attempting to board a boat.  The boat looks quite unique, if not impressive, as it has two cloth floats attached together by a board upon which they will sit on.  It appeared to have glimmering shields attached to the floats.  However, when they actually climbed on, the floats went sideways, and their voyage never took off.  "}}, "The Isle of War": {"text": "You land on a large island, where you can see that at least on the small part of it that is visible to you, a battle is raging.  On one side is a small, hastily constructed tent that men run in and out of issuing orders, while on the other, a majestic castle stands.  ", "branches": {"The Rebellion ": "You approach the command headquarters of the less organized looking side of the battle on the island.  You speak to the leader, who tells you that he is the leader of the rebellion.  For many generations, their island nation had been ruled by a family of monarchs.  For many years, they ruled happily.  However, now, they had started organizing their military in order to launch an attack on the neighboring nations and conquer the entire island.  The rebels are happy with their peaceful island, and want none of this.  However, in their protest, the monarchy and the loyalists got out of hand, and started a civil war.  ", "The Monarchy": "You approach the grand castle that serves as the base for the monarchy and the loyalists.  You speak to the military leader, who tells you that they are all loyal citizens who trust in their monarchs, as they have not led them astray for many generations.  They are content carrying out the attacks against their own people because they have allied themselves against the state in their protests.  You then go to speak to the King, who as it turns out, is a teenager that is completley uninterested in the entire process, and passes most of his decisions onto his advisor - who had been exiled from their direct neighboring country years previously.  "}}, "Isle of the Gnomes": {"text": "You approach the island, which visible to you now is only a hill with a cave entrance at its base.  There is also only a few feet offshore a large stone statue of a what looks like a man with very squashed proportions.", "branches": {"Overlook": "You climb up onto a the top of a large hill overlooking the island.  It is covered with what appears to be holes in the ground and caves, which appear every few hundred paces.  This gives you a gut feeling of unease. ", "Gnome Cave": "You enter a cave that sprawls out beyond the edge of your vision.  You see nothing but the glint of thousands of tiny eyes, watching your every move.  This cave makes you feel uneasy, so you quickly exit before anything goes wrong.  "}}}
